"""
 Файл, содержащий настройки сервера. В нем необходимо задать
 все параметра, неотходимые для правильной работы, такие как
 IP адресс, порт, обработчик запросов и его параметры.

===============================================================================

 "Server" секция

===============================================================================

===============================================================================
 @var PYTHON_BIN: 
 Путь к исполняемому файлу интерпретатора Python ( > 3.0 )
===============================================================================

===============================================================================
 @var SPY_INTERVAL: 
 Интервал (в секундах) между проверками файлов сервера на
 изменение. Float!
===============================================================================

===============================================================================
 @var AUTORESTART: 
 Флаг, указывающий на необходимость запуска файлового
 монитора, отслеживающего изменения файлов.
===============================================================================

===============================================================================
 @var PROGRAM: 
 Поле, хранящее экземпляр класса программы, которая будет
 заниматься обработкой запросов пользователей. Программа должна реализовывать
 интерфейс IProgram, описанный в модуле interfaces.iprogram
===============================================================================

===============================================================================
 @var SERVER_REALIZATION: 
 Поле, хранящее в себе класс (не экземпляр) реализации
 сервера на низком уровне ( модуля, которые реализует взаимодействие с 
 пользователями по протоколу TCP/IP). Класс должен реализовывать интерфейс
 IServer, описанный в модуле interfaces.iserver
===============================================================================

===============================================================================
 var SERVER_SETTINGS: 
 Поле, хранящее в себе экземпляр класса настроек сервера
 ServerSettings. Класс ServerSettiongs описан в модуле interfaces.iserver.
 Для инициализации требуется передать в конструктор три параметра:
    ip - IP адрес сервера
    port - порт, на котором будет работать сервер
    handler -  класс низкоуровневого обработчика запросов клиентов. 
    Дополнительную информацию по последнему параметру см. в документации
    интерфейсов, описанных в модулях interfaces/*
===============================================================================

===============================================================================
 @var SPY_REALIZATION:
 Класс конкретной реализации файлового монитора, отслеживающего изменения файлов.
 Класс должен быть потомком интерфейса, описанного в файле interfaces.ispy,
 стандартная реализация описана в модуле standart.filespy
===============================================================================

===============================================================================
 @var FILES_SERVER:
 @var FILES_PROGRAM:
 Списки файлов, за которыми будет наблюдать файловый демон.
 Для упрощения задания списков можно воспользоваться функцией find,
 определенной во внешнем модуле helpers.filefilter.
===============================================================================

"""

from helpers.filefilter import find
from helpers.tweak import Section

Server = Section({
    "FILES_SERVER" : find(".", ".py"),
    "FILES_PROGRAM" : find(".", ".py"),
    "SPY_INTERVAL" : 2,
    "PYTHON_BIN": "/usr/bin/python3",
    "AUTORESTART" : True,
    "SPY_REALIZATION" : "lazy://extra.server.standart.filespy::FileSpy",
    "SERVER_REALIZATION" : "lazy://extra.server.standart.tcpserver::SimpleHttpServer",
    "PROGRAM" : "lazy://vitamin.bindings.extraserver::ServerProgram",
    "SERVER_SETTINGS" : Section({"ip":"127.0.0.1",
                                 "port":8089,
                                 "handler":"lazy://extra.server.standart.tcpserver::RequestMapper"})
})

Program = Section({
    "HTML" : "./html",
    "ERRORS" : "./errors"
})
